<template><div><h1 id="通道管理" tabindex="-1"><a class="header-anchor" href="#通道管理"><span>通道管理</span></a></h1>
<p>通道管理为了对已经分配国标编号的通道进行统一的行政区划和业务分组管理,国标中对于组织结构有两种表示方式,一种是按照行政区划,一种是业务分组+虚拟组织的方式. 行政区划结构固定,比如: 北京/市辖区/昌平区, 通道可以挂载道何一级行政区划下. 业务分组比较灵活, 可以按照自己的随意取名, 但是通道只能放在业务分组下的虚拟组织里,不能放在业务分组下.</p>
<h2 id="行政区划" tabindex="-1"><a class="header-anchor" href="#行政区划"><span>行政区划</span></a></h2>
<p>左侧树结构为行政区划结构,添加设备( 可以将某个国标设备下的通道全部添加道某一个节点下),移除设备(可以将某个国标设备下的通道全部从这个节点移除) 右侧伪通道列表, 对于非国标接入的设备只有配置了国标编号后才可以在这里进行操作, 添加状态选择&quot;未添加&quot;可以进行添加操作,选择&quot; 已添加&quot;进行移除操作
<img src="/images/img/6.png" alt="VuePress Logo"></p>
<h2 id="业务分组" tabindex="-1"><a class="header-anchor" href="#业务分组"><span>业务分组</span></a></h2>
<p>左侧树结构为业务分组结构,添加设备( 可以将某个国标设备下的通道全部添加道某一个节点下),移除设备(可以将某个国标设备下的通道全部从这个节点移除) 业务分组下不能挂载设备,所以没有选择该节点的单选框. 右侧伪通道列表, 对于非国标接入的设备只有配置了国标编号后才可以在这里进行操作, 添加状态选择&quot;未添加&quot;可以进行添加操作,选择&quot; 已添加&quot;进行移除操作
<img src="/images/img/7.png" alt="VuePress Logo"></p>
</div></template>


