<template><div><h1 id="国标设备" tabindex="-1"><a class="header-anchor" href="#国标设备"><span>国标设备</span></a></h1>
<p><img src="/images/img/4.png" alt="VuePress Logo"></p>
<h2 id="更新设备通道" tabindex="-1"><a class="header-anchor" href="#更新设备通道"><span>更新设备通道</span></a></h2>
<p>点击列表末尾的“刷新”按钮，可以看到一个圆形进度条，等进度结束提示成功后即可更新完成，如果通道数量有变化你可以看点击左上角的刷新即可看到通道数量的变化；如果通道数量仍未0,那么可能时对方尚未推送通道给你。</p>
<h1 id="查看设备通道" tabindex="-1"><a class="header-anchor" href="#查看设备通道"><span>查看设备通道</span></a></h1>
<p>点击列表末尾的“通道”按钮，</p>
<h1 id="编辑设备" tabindex="-1"><a class="header-anchor" href="#编辑设备"><span>编辑设备</span></a></h1>
<p>点击列表末尾的“编辑”按钮，即可在打开的弹窗中对设备功能进行修改</p>
<ul>
<li>设备名称：如何未能从设备里读取到设备名称或者需要自己重命名，那么可以修改此选项。</li>
<li>密码：支持为设备配置独立的密码.</li>
<li>收流IP：如果你需要设备从指定的网络地址接入视频流,那么可以配置此IP,设备将会发流到这个IP,比如多网卡接入的服务器.或者存在网络映射的情况.</li>
<li>流媒体ID：固定设备使用的流媒体ID,默认根据负载自动分配.</li>
<li>字符集：修改读取设备数据时使用的字符集，默认为GB2312,但是GB2312收录的汉字不全，所以有时候回遇到乱码，可以修改为UTF-8来解决。</li>
<li>目录订阅：填写订阅周期即可对设备开启目录订阅，设备如果支持目录订阅那么设备在通道信息发生变化时就会通知系统哪些通道发生了那些变化，包括通道增加/删除/更新/上线/下线/视频丢失/故障。0为取消订阅。 一般NVR和平台对接可以开启此选项，直接接摄像机开启此选项意义不大。</li>
<li>移动位置订阅：对设备开启移动位置订阅，设备如果支持目录订阅那么设备位置发生变化时会通知到系统,一般执法记录仪可以开启此选项，对固定位置的设备意义不大。</li>
<li>SSRC校验：为了解决部分设备出现的串流问题，可以打开此选项。ZLM会严格按照给定的ssrc处理视频流。部分设备流信息不标准，开启可能导致无法点播。</li>
<li>作为消息通道 系统支持通过报警消息给下级系统互相推送消息,消息内容由redis消息发送给系统,系统编辑成报警消息发送给下级</li>
<li>收到ACK后发流：语音对讲策略: 不同的设备对于语音对讲的收流时机要求不一,勾选后会在收到设备发送的ack后再开始发流,不勾选则在回复200OK后开始发流,目前已知大华设备不勾选,海康需要勾选.</li>
</ul>
<h2 id="删除设备" tabindex="-1"><a class="header-anchor" href="#删除设备"><span>删除设备</span></a></h2>
<p>可以删除系统中的设备信息，如果设备28181配置未更改，那么设备在下一次注册后仍然会注册上来。</p>
<h2 id="点播视频" tabindex="-1"><a class="header-anchor" href="#点播视频"><span>点播视频</span></a></h2>
<p>进入通道列表后，点击列表末尾的“播放”按钮，稍等即可弹出播放页面</p>
<h2 id="设备录像" tabindex="-1"><a class="header-anchor" href="#设备录像"><span>设备录像</span></a></h2>
<p>进入通道列表后，点击列表末尾的“设备录像”按钮，也可以在播放页面点击录像查询进入录像查看页面，选择要查看的日期即可对录像进行播放和下载。</p>
<h2 id="云台控制-暂时没有" tabindex="-1"><a class="header-anchor" href="#云台控制-暂时没有"><span>云台控制（暂时没有）</span></a></h2>
<p>可以对支持云台功能的设备进行上下左右的转动以及拉近拉远的操作。</p>
<h2 id="获取视频的播放器地址-暂时没有" tabindex="-1"><a class="header-anchor" href="#获取视频的播放器地址-暂时没有"><span>获取视频的播放器地址（暂时没有）</span></a></h2>
<p>视频点播成功后在实时视频页面，点击“更多地址”可以看到所有的播放地址，地址是否可以播放与你是否完整编译启用zlm功能有关，更与网络有关。</p>
<h2 id="语音对讲-暂时没有" tabindex="-1"><a class="header-anchor" href="#语音对讲-暂时没有"><span>语音对讲（暂时没有）</span></a></h2>
</div></template>


