<template><div><h1 id="国标级联" tabindex="-1"><a class="header-anchor" href="#国标级联"><span>国标级联</span></a></h1>
<p><img src="/images/img/8.png" alt="VuePress Logo"></p>
<h2 id="使用" tabindex="-1"><a class="header-anchor" href="#使用"><span>使用</span></a></h2>
<p>国标28181不同平台之间支持两种连接方式，平级和上下级，系统目前支持向上级级联。</p>
<h2 id="添加上级平台" tabindex="-1"><a class="header-anchor" href="#添加上级平台"><span>添加上级平台</span></a></h2>
<p>在国标级联页面点击“添加”按钮，以推送到上级系统为例子，参看接入设备
<img src="/images/img/9.png" alt="VuePress Logo"></p>
<ol>
<li>名称：上级平台看到的下级平台名称;</li>
<li>本地IP：本地连接上级使用的具体哪个网卡;</li>
<li>SIP认证用户名：可以设置为与&quot;设备国标编号&quot;一致;</li>
<li>注册周期：间隔多久发起一次注册,单位秒;</li>
<li>心跳周期：间隔多久发送一次心跳,一般上级平台三次收不到心跳就会认为下级离线了, 所以建议{心跳周期}x3 &lt; 注册周期;</li>
<li>SDP发流IP：调用媒体节点发送视频流给上级时,使用的本地IP;</li>
<li>信令传输：信令传输模式,支持udp和TCP,没有特殊需求,默认UDP即可;</li>
<li>目录分组：上级发送&quot;CATALOG&quot;消息查询通道信息,每一条消息中携带几条通道信息,默认为1,增大该值,可以加快通道发送速度;</li>
<li>字符集：发送给上级&quot;MESSAGE&quot;消息中的消息体使用的编码格式,国标28181-2016默认为GB2312;</li>
<li>行政区划：如果勾选&quot;其他选项/推送平台信息&quot;选项,会给上级推送平台信息,这里就是平台的行政区划信息</li>
<li>平台厂商：如果勾选&quot;其他选项/推送平台信息&quot;选项,会给上级推送平台信息,这里就是平台的平台厂商信息</li>
<li>平台型号：如果勾选&quot;其他选项/推送平台信息&quot;选项,会给上级推送平台信息,这里就是平台的平台型号信息</li>
<li>平台安装地址：如果勾选&quot;其他选项/推送平台信息&quot;选项,会给上级推送平台信息,这里就是平台的平台安装地址信息</li>
<li>其他选项</li>
</ol>
<ul>
<li>RTCP保活：在上级的流传输模式为UDP时,因为UDP的无状态特性,会无法知道上级是否在正常收流,启用RTCP保活时,就可以主动发送RTCP消息确认上级是否在正常收流, 异常情况下,可以下级主动停止发流;</li>
<li>消息通道：支持通过报警消息给上级级系统推送消息,消息内容由redis消息发送给系统,系统编辑成报警消息发送给上级;</li>
<li>主动推送通道：
系统模拟一条目录订阅信息,然后在共享通道变化时,发送CATAOLOG事件给上级,通知具体的通道变化,
目前支持的状态有: 状态改变事件 ON:上线,OFF:离线,VLOST:视频丢失,DEFECT:故障,ADD:增加,DEL:删除,UPDATE:更新;</li>
<li>推送平台信息：勾选此项,上级收到的通道信息中会多出一个平台信息的通道.内容在平台的编辑中修改;</li>
<li>推送分组信息：勾选此项,如果你共享的通道分配了具体的业务分组以及虚拟组织,那么上级收到的通道中会包括业务分组以及虚拟组织节点信息;</li>
<li>推送行政区划：勾选此项,如果你共享的通道分配了具体的行政区划,那么上级收到的通道中会包括行政区划信息;</li>
</ul>
<p>国标级联列表出现了级联的这个平台；同时状态显示为在线，如果状态为离线那么可能是你的服务信息配置有误或者网络不通。 订阅信息列有三个图标，表示上级开启订阅，从左到右依次是：报警订阅，目录订阅，移动位置订阅。</p>
<h2 id="通道共享" tabindex="-1"><a class="header-anchor" href="#通道共享"><span>通道共享</span></a></h2>
<p>点击你要推送的平台的“通道共享”按钮。
<img src="/images/img/10.png" alt="VuePress Logo"></p>
<ol>
<li>添加状态选择&quot;未共享&quot;可以将具体的通道共享给上级;</li>
<li>添加状态选择&quot;已共享&quot;可以看到已经共享的通道,并且支持为这个通道在这个平台设备专门的名称和编号;</li>
<li>点击&quot;按设备添加&quot;可以将某个国标设备下的所有通道共享给上级;</li>
<li>点击&quot;按设备移除&quot;可以将某个国标设备下的所有通道取消共享给上级;</li>
<li>点击&quot;全部添加&quot;可以将所有通道共享给上级；</li>
<li>点击&quot;全部移除&quot;可以将所有通道共享给上级；</li>
</ol>
<h2 id="推送通道" tabindex="-1"><a class="header-anchor" href="#推送通道"><span>推送通道</span></a></h2>
<p>系统会将所有通道信息按照目录订阅消息通知形式,发送ADD事件给上级.</p>
</div></template>


